{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 100, 5], "name": "input_5"}, "name": "input_5", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"padding": "valid", "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "strides": [1], "trainable": true, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [29], "kernel_regularizer": null, "name": "conv1d_4"}, "name": "conv1d_4", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_2", "rate": 0.2}, "name": "dropout_2", "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "name": "flatten_1", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "units": 64, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_1"}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_3", "rate": 0.2}, "name": "dropout_3", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "sigmoid", "use_bias": true, "activity_regularizer": null, "units": 1, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_2"}, "name": "dense_2", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}], "output_layers": [["dense_2", 0, 0]], "name": "model_1", "input_layers": [["input_5", 0, 0]]}}