{"class_name": "Model", "config": {"input_layers": [["input_8", 0, 0]], "name": "model_5", "output_layers": [["dense_14", 0, 0]], "layers": [{"name": "input_8", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 5], "sparse": false, "dtype": "float32", "name": "input_8"}, "inbound_nodes": []}, {"name": "lstm_4", "class_name": "LSTM", "config": {"dropout": 0.2, "return_sequences": false, "kernel_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "use_bias": true, "unroll": false, "stateful": false, "kernel_constraint": null, "name": "lstm_4", "units": 254, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "trainable": true, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "return_state": false, "implementation": 1, "activation": "tanh"}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "dense_11", "class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "name": "dense_11", "units": 254, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["lstm_4", 0, 0, {}]]]}, {"name": "dense_12", "class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "name": "dense_12", "units": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["dense_11", 0, 0, {}]]]}, {"name": "dense_13", "class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "name": "dense_13", "units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["dense_12", 0, 0, {}]]]}, {"name": "dense_14", "class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "name": "dense_14", "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "sigmoid"}, "inbound_nodes": [[["dense_13", 0, 0, {}]]]}]}, "backend": "tensorflow", "keras_version": "2.2.4"}