{"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 100, 5, 1], "name": "input_1", "dtype": "float32", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "filters": 32, "name": "conv2d_1", "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "dropout_1"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_first"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "flatten_1"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "units": 64, "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1"}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_2", "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_2"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "units": 1, "activation": "sigmoid", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_2"}], "name": "model_1"}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4"}